//
//  Constants.swift
//  FontsApp
//
//  Created by admin on 05/03/2020.
//  Copyright © 2020 SangNX. All rights reserved.
//

import Foundation
import UIKit

struct Font {
    var row1: [String]
    var row2: [String]
    var row3: [String]
    
    var rowNum: [String]
}

struct CustomFont {
    var name: String!
    var fonts: Font!
    var fontsCL: Font!
    
    init(name: String, font: Font, fontCL: Font) {
        self.name = name
        self.fonts = font
        self.fontsCL = fontCL
    }
}

//"q","w","e","r","t","y","u","i","o","p"
//"a","s","d","f","g","h","j","k","l"
//"z","x","c","v","b","n","n"
//"1","2","3","4","5","6","7","8","9","0"

//"Q","W","E","R","T","Y","U","I","O","P"
//"A","S","D","F","G","H","J","K","L"
//"Z","X","C","V","B","N","M"

var fonts =
    [CustomFont(name: "Ⓒⓘⓡⓒⓛⓔⓓ",
        font: Font(row1: ["ⓠ","ⓦ","ⓔ","ⓡ","ⓣ","ⓨ","ⓤ","ⓘ","ⓞ","ⓟ"],
                    row2: ["ⓐ","ⓢ","ⓓ","ⓕ","ⓖ","ⓗ","ⓙ","ⓚ","ⓛ"],
                    row3: ["ⓩ","ⓧ","ⓒ","ⓥ","ⓑ","ⓝ","ⓜ"],
                    rowNum: ["①","②","③","④","⑤","⑥","⑦","⑧","⑨","0"]),
        fontCL: Font(row1: ["Ⓠ","Ⓦ","Ⓔ","Ⓡ","Ⓣ","Ⓨ","Ⓤ","Ⓘ","Ⓞ","Ⓟ"],
                    row2: ["Ⓐ","Ⓢ","Ⓓ","Ⓕ","Ⓖ","Ⓗ","Ⓙ","Ⓚ","Ⓛ"],
                    row3: ["Ⓩ","Ⓧ","Ⓒ","Ⓥ","Ⓑ","Ⓝ","Ⓜ"],rowNum: [])),
    CustomFont(name: "Ｆｕｌｌｗｉｄｔｈ",
        font: Font(row1: ["ｑ","ｗ","ｅ","ｒ","ｔ","ｙ","ｕ","ｉ","ｏ","ｐ"],
                row2: ["ａ","ｓ","ｄ","ｆ","ｇ","ｈ","ｊ","ｋ","ｌ"],
                row3: ["ｚ","ｘ","ｃ","ｖ","ｂ","ｎ","ｎ"],
                rowNum: ["１","２","３","４","５","６","７","８","９","０"]),
        fontCL: Font(row1: ["Ｑ","Ｗ","Ｅ","Ｒ","Ｔ","Ｙ","Ｕ","Ｉ","Ｏ","Ｐ"],
                row2: ["Ａ","Ｓ","Ｄ","Ｆ","Ｇ","Ｈ","Ｊ","Ｋ","Ｌ"],
                row3: ["Ｚ","Ｘ","Ｃ","Ｖ","Ｂ","Ｎ","Ｍ"],rowNum: [])),
    CustomFont(name: "𝐌𝐚𝐭𝐡 𝐛𝐨𝐥𝐝",
       font: Font(row1: ["𝐪","𝐰","𝐞","𝐫","𝐭","𝐲","𝐮","𝐢","𝐨","𝐩"],
                  row2: ["𝐚","𝐬","𝐝","𝐟","𝐠","𝐡","𝐣","𝐤","𝐥"],
                  row3: ["𝐳","𝐱","𝐜","𝐯","𝐛","𝐧","𝐧"],
                  rowNum: ["𝟏","𝟐","𝟑","𝟒","𝟓","𝟔","𝟕","𝟖","𝟗","𝟎"]),
      fontCL: Font(row1: ["𝐐","𝐖","𝐄","𝐑","𝐓","𝐘","𝐔","𝐈","𝐎","𝐏"],
                   row2: ["𝐀","𝐒","𝐃","𝐅","𝐆","𝐇","𝐉","𝐊","𝐋"],
                   row3: ["𝐙","𝐗","𝐂","𝐕","𝐁","𝐍","𝐌"],rowNum: [])),
    CustomFont(name: "𝕸𝖆𝖙𝖍 𝕱𝖗𝖆𝖐𝖙𝖚𝖗",
      font: Font(row1: ["𝖖","𝖜","𝖊","𝖗","𝖙","𝖞","𝖚","𝖎","𝖔","𝖕"],
                 row2: ["𝖆","𝖘","𝖉","𝖋","𝖌","𝖍","𝖏","𝖐","𝖑"],
                 row3: ["𝖟","𝖝","𝖈","𝖛","𝖇","𝖓","𝖓"],
                 rowNum: ["1","2","3","4","5","6","7","8","9","0"]),
     fontCL: Font(row1: ["𝕼","𝖂","𝕰","𝕽","𝕿","𝖄","𝖀","𝕴","𝕺","𝕻"],
                  row2: ["𝕬","𝕾","𝕯","𝕱","𝕲","𝕳","𝕵","𝕶","𝕷"],
                  row3: ["𝖅","𝖃","𝕮","𝖁","𝕭","𝕹","𝕸"],rowNum: []))]
