//
//  Constants.swift
//  FontsApp
//
//  Created by admin on 05/03/2020.
//  Copyright © 2020 SangNX. All rights reserved.
//

import Foundation
import UIKit

struct Font {
    var row1: [String]
    var row2: [String]
    var row3: [String]
    
    var rowNum: [String]
}

struct CustomFont {
    var name: String!
    var fonts: Font!
    var fontsCL: Font!
    
    init(name: String, font: Font, fontCL: Font) {
        self.name = name
        self.fonts = font
        self.fontsCL = fontCL
    }
}

struct Constant {
    
    static let SCREEN_SIZE: CGRect = UIScreen.main.bounds
    static let SREEEN_WIDTH = SCREEN_SIZE.width
    static let SCREEN_HEIGHT = SCREEN_SIZE.height
    static let IS_IPHONEX: Bool = SCREEN_HEIGHT >= 812 ? true : false
}


//"q","w","e","r","t","y","u","i","o","p"
//"a","s","d","f","g","h","j","k","l"
//"z","x","c","v","b","n","m"
//"1","2","3","4","5","6","7","8","9","0"

//"Q","W","E","R","T","Y","U","I","O","P"
//"A","S","D","F","G","H","J","K","L"
//"Z","X","C","V","B","N","M"

var fonts =
    [CustomFont(name: "Ｆｕｌｌｗｉｄｔｈ",
        font: Font(row1: ["ｑ","ｗ","ｅ","ｒ","ｔ","ｙ","ｕ","ｉ","ｏ","ｐ"],
                row2: ["ａ","ｓ","ｄ","ｆ","ｇ","ｈ","ｊ","ｋ","ｌ"],
                row3: ["ｚ","ｘ","ｃ","ｖ","ｂ","ｎ","ｎ"],
                rowNum: ["１","２","３","４","５","６","７","８","９","０"]),
        fontCL: Font(row1: ["Ｑ","Ｗ","Ｅ","Ｒ","Ｔ","Ｙ","Ｕ","Ｉ","Ｏ","Ｐ"],
                row2: ["Ａ","Ｓ","Ｄ","Ｆ","Ｇ","Ｈ","Ｊ","Ｋ","Ｌ"],
                row3: ["Ｚ","Ｘ","Ｃ","Ｖ","Ｂ","Ｎ","Ｍ"],rowNum: [])),
    CustomFont(name: "𝐌𝐚𝐭𝐡 𝐛𝐨𝐥𝐝",
       font: Font(row1: ["𝐪","𝐰","𝐞","𝐫","𝐭","𝐲","𝐮","𝐢","𝐨","𝐩"],
                  row2: ["𝐚","𝐬","𝐝","𝐟","𝐠","𝐡","𝐣","𝐤","𝐥"],
                  row3: ["𝐳","𝐱","𝐜","𝐯","𝐛","𝐧","𝐧"],
                  rowNum: ["𝟏","𝟐","𝟑","𝟒","𝟓","𝟔","𝟕","𝟖","𝟗","𝟎"]),
      fontCL: Font(row1: ["𝐐","𝐖","𝐄","𝐑","𝐓","𝐘","𝐔","𝐈","𝐎","𝐏"],
                   row2: ["𝐀","𝐒","𝐃","𝐅","𝐆","𝐇","𝐉","𝐊","𝐋"],
                   row3: ["𝐙","𝐗","𝐂","𝐕","𝐁","𝐍","𝐌"],rowNum: [])),
    CustomFont(name: "𝕸𝖆𝖙𝖍 𝕱𝖗𝖆𝖐𝖙𝖚𝖗",
      font: Font(row1: ["𝖖","𝖜","𝖊","𝖗","𝖙","𝖞","𝖚","𝖎","𝖔","𝖕"],
                 row2: ["𝖆","𝖘","𝖉","𝖋","𝖌","𝖍","𝖏","𝖐","𝖑"],
                 row3: ["𝖟","𝖝","𝖈","𝖛","𝖇","𝖓","𝖓"],
                 rowNum: ["1","2","3","4","5","6","7","8","9","0"]),
     fontCL: Font(row1: ["𝕼","𝖂","𝕰","𝕽","𝕿","𝖄","𝖀","𝕴","𝕺","𝕻"],
                  row2: ["𝕬","𝕾","𝕯","𝕱","𝕲","𝕳","𝕵","𝕶","𝕷"],
                  row3: ["𝖅","𝖃","𝕮","𝖁","𝕭","𝕹","𝕸"],rowNum: [])),
    CustomFont(name: "🆂🆀🆄🅰🆁🅴🅳",
    font: Font(row1: ["🆀","🆆","🅴","🆁","🆃","🆈","🆄","🅸","🅾","🅿"],
                row2: ["🅰","🆂","🅳","🅵","🅶","🅷","🅹","🅺","🅻"],
                row3: ["🆉","🆇","🅲","🆅","🅱","🅽","🅼"],
                rowNum: ["1","2","3","4","5","6","7","8","9","0"]),
    fontCL: Font(row1: ["🆀","🆆","🅴","🆁","🆃","🆈","🆄","🅸","🅾","🅿"],
                 row2: ["🅰","🆂","🅳","🅵","🅶","🅷","🅹","🅺","🅻"],
                 row3: ["🆉","🆇","🅲","🆅","🅱","🅽","🅼"],rowNum: [])),
    CustomFont(name: "⒫⒜⒭⒠⒩⒯⒣",
    font: Font(row1: ["⒬","⒲","⒠","⒭","⒯","⒴","⒰","⒤","⒪","⒫"],
                row2: ["⒜","⒮","⒟","⒡","⒢","⒣","⒥","⒦","⒧"],
                row3: ["⒵","⒳","⒞","⒱","⒝","⒩","⒨"],
                rowNum: ["⑴","⑵","⑶","⑷","⑸","⑹","⑺","⑻","⑼","0"]),
    fontCL: Font(row1: ["⒬","⒲","⒠","⒭","⒯","⒴","⒰","⒤","⒪","⒫"],
                 row2: ["⒜","⒮","⒟","⒡","⒢","⒣","⒥","⒦","⒧"],
                 row3: ["⒵","⒳","⒞","⒱","⒝","⒩","⒨"],rowNum: [])),
    CustomFont(name: "𝔻𝕠𝕦𝕓𝕝𝕖-𝕤𝕥𝕣𝕦𝕔𝕜",
    font: Font(row1: ["𝕢","𝕨","𝕖","𝕣","𝕥","𝕪","𝕦","𝕚","𝕠","𝕡"],
                row2: ["𝕒","𝕤","𝕕","𝕗","𝕘","𝕙","𝕛","𝕜","𝕝"],
                row3: ["𝕫","𝕩","𝕔","𝕧","𝕓","𝕟","𝕞"],
                rowNum: ["𝟙","𝟚","𝟛","𝟜","𝟝","𝟞","𝟟","𝟠","𝟡","𝟘"]),
    fontCL: Font(row1: ["ℚ","𝕎","𝔼","ℝ","𝕋","𝕐","𝕌","𝕀","𝕆","ℙ"],
                 row2: ["𝔸","𝕊","𝔻","𝔽","𝔾","ℍ","𝕁","𝕂","𝕃"],
                 row3: ["ℤ","𝕏","ℂ","𝕍","𝔹","ℕ","𝕄"],rowNum: [])),
    CustomFont(name: "ꜱᴛʀᴏᴋᴇᴅ",
    font: Font(row1: ["ꝗ","w","ɇ","ɍ","ŧ","ɏ","ᵾ","ɨ","ø","ᵽ"],
                row2: ["Ⱥ","s","đ","f","ǥ","ħ","ɉ","ꝁ","ł"],
                row3: ["ƶ","x","ȼ","v","ƀ","n","m"],
                rowNum: ["1","2","3","4","5","6","7","8","9","0"]),
    fontCL: Font(row1: ["Ꝗ","W","Ɇ","Ɍ","Ŧ","Ɏ","ᵾ","Ɨ","Ø","Ᵽ"],
                 row2: ["Ⱥ","S","Đ","F","Ǥ","Ħ","Ɉ","Ꝁ","Ł"],
                 row3: ["Ƶ","X","Ȼ","V","Ƀ","N","M"],rowNum: [])),
    CustomFont(name: "Cᴀᴘɪᴛᴀʟ",
    font: Font(row1: ["꟮","ᴡ","ᴇ","ʀ","ᴛ","ʏ","ᴜ","ɪ","ᴏ","ᴘ" ],
                row2: ["ᴀ","ꜱ","ᴅ","ꜰ","ɢ","ʜ","ᴊ","ᴋ","ʟ"],
                row3: ["ᴢ","꟯","ᴄ","ᴠ","ʙ","ɴ","ᴍ"],
                rowNum: ["1","2","3","4","5","6","7","8","9","0"]),
    fontCL: Font(row1: ["꟮","ᴡ","ᴇ","ʀ","ᴛ","ʏ","ᴜ","ɪ","ᴏ","ᴘ" ],
                 row2: ["ᴀ","ꜱ","ᴅ","ꜰ","ɢ","ʜ","ᴊ","ᴋ","ʟ"],
                 row3: ["ᴢ","꟯","ᴄ","ᴠ","ʙ","ɴ","ᴍ"],rowNum: [])),
    CustomFont(name: "𝚖𝚘𝚗𝚘𝚜𝚙𝚊𝚌𝚎",
    font: Font(row1: ["𝚚","𝚠","𝚎","𝚛","𝚝","𝚢","𝚞","𝚒","𝚘","𝚙"],
                row2: ["𝚊","𝚜","𝚍","𝚏","𝚐","𝚑","𝚓","𝚔","𝚕"],
                row3: ["𝚣","𝚡","𝚌","𝚟","𝚋","𝚗","𝚖"],
                rowNum: ["𝟷","𝟸","𝟹","𝟺","𝟻","𝟼","𝟽","𝟾","𝟿","𝟶"]),
    fontCL: Font(row1: ["𝚀","𝚆","𝙴","𝚁","𝚃","𝚈","𝚄","𝙸","𝙾","𝙿" ],
                 row2: ["𝙰","𝚂","𝙳","𝙵","𝙶","𝙷","𝙹","𝙺","𝙻"],
                 row3: ["𝚉","𝚇","𝙲","𝚅","𝙱","𝙽","𝙼"],rowNum: [])),
    CustomFont(name: "Ⓒⓘⓡⓒⓛⓔⓓ",
    font: Font(row1: ["ⓠ","ⓦ","ⓔ","ⓡ","ⓣ","ⓨ","ⓤ","ⓘ","ⓞ","ⓟ"],
            row2: ["ⓐ","ⓢ","ⓓ","ⓕ","ⓖ","ⓗ","ⓙ","ⓚ","ⓛ"],
            row3: ["ⓩ","ⓧ","ⓒ","ⓥ","ⓑ","ⓝ","ⓜ"],
            rowNum: ["①","②","③","④","⑤","⑥","⑦","⑧","⑨","0"]),
    fontCL: Font(row1: ["Ⓠ","Ⓦ","Ⓔ","Ⓡ","Ⓣ","Ⓨ","Ⓤ","Ⓘ","Ⓞ","Ⓟ"],
                row2: ["Ⓐ","Ⓢ","Ⓓ","Ⓕ","Ⓖ","Ⓗ","Ⓙ","Ⓚ","Ⓛ"],
                row3: ["Ⓩ","Ⓧ","Ⓒ","Ⓥ","Ⓑ","Ⓝ","Ⓜ"],rowNum: []))]
